In [8]:
import string

row_names = list(string.ascii_lowercase)

In [9]:
import pandas as pd
import numpy as np

my_data = np.random.randint(1, 30, size = (5, 3))

df1 = pd.DataFrame(my_data, columns=['var1', 'var2', 'var3'],)
df1.index = row_names[:len(df.index)]
df1

   var1  var2  var3
a    20    18     9
b    24    11    24
c    19    22    19
d    21    15    18
e    12    25     4

In [11]:
df2 = df1+10
df2

   var1  var2  var3
a    30    28    19
b    34    21    34
c    29    32    29
d    31    25    28
e    22    35    14

In [21]:
pd.concat([df1, df2], ignore_index=False, axis=1)

   var1  var2  var3  var1  var2  var3
a    20    18     9    30    28    19
b    24    11    24    34    21    34
c    19    22    19    29    32    29
d    21    15    18    31    25    28
e    12    25     4    22    35    14

In [23]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

#### Advanced Operations.

In [24]:
my_df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

my_df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

In [25]:
my_df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [26]:
my_df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [29]:
pd.merge(my_df1, my_df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [30]:
pd.merge(my_df1, my_df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

##### Many to one

In [31]:
df3 = pd.merge(my_df1, my_df2)

In [32]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

In [33]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

##### Many to many

In [34]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

In [35]:
pd.merge(my_df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim